mashlaiCA/telemetry-tx-stm32f103/src/drivers/gpio/gpio_hw.h
#ifndef GPIO_H
#define GPIO_H

#include "stdint.h"
#include "stm32f103xb.h"


#ifdef __cplusplus
extern "C" {
#endif

/**
 * @file gpioA.h
 * @brief Driver for GPIOA pins on STM32F103xx microcontroller.
 * This module provides functions to initialize GPIOA pins for analog input
 * and LED output, as well as functions to set and reset LED pins.
 */

/** @brief Initialize GPIOA peripheral clock.
 *  This function enables the GPIOA clock in the RCC APB2ENR register.
 */
void gpio_A_init(void);

/** @brief Initialize GPIOB peripheral clock.
 *  This function enables the GPIOB clock in the RCC APB2ENR register.
 */
void gpio_B_init(void);

/** @brief Initialize GPIOB pin for I2C SDA and SCL.
 *   This function performs the following steps:
 *  1. Clear the CNF and MODE bits for the specified GPIOB pin.
 *  2. Configure the specified GPIOB pin as an alternate function open-drain
 *     with a maximum speed of 50 MHz.
 *  @param pin The GPIOB pin number (0-7) to configure for I2C SDA or SCL.
 */
void gpio_B_init_I2C_SDA_SCL(uint8_t pin);

/** @brief Initialize GPIOA pin as analog input.
 *   This function performs the following steps:
 *  1. Enable the GPIOA clock in the RCC APB2ENR register.
 *  2. Configure the specified GPIOA pin as an analog input.
 *  @param pin The GPIOA pin number (0-7) to configure as analog input.
 */
void gpio_a_analog_input_init(uint8_t pin);

void gpio_PBx_analog_input_init(uint8_t pin);

void ntc_gpio_init(void);

void gpio_PBx_polarity_init(uint8_t pinB);

void polarity_PBx_fwd(uint8_t pin1, uint8_t pin2);

void polarity_PBx_rev(uint8_t pin1, uint8_t pin2);

void polarity_PBx_off(uint8_t pin1, uint8_t pin2);

void gpio_A_polarity_init(uint8_t pin1);

void polarity_fwd(uint8_t pin1, uint8_t pin2);

void polarity_rev(uint8_t pin1, uint8_t pin2);

void polarity_off(uint8_t pin1, uint8_t pin2);



/** @brief Initialize GPIOA pin as LED output.
 *   This function performs the following steps:
 *  1. Clear the CNF and MODE bits for the specified GPIOA pin.
 *  2. Configure the specified GPIOA pin as a push-pull output.
 *  3. Set the GPIOA pin high to turn off the LED.
 *  @param pin The GPIOA pin number (0-7) to configure as LED output.
 */
void gpio_a_led_output_init(uint8_t pin);

/** @brief Set GPIOA pin low to turn on LED.
 *  This function sets the specified GPIOA pin low using the BRR register
 *  to turn on the connected LED light bulb.
 *  @param led_gpio The GPIOA pin number (0-7) connected to the LED.
 */
void gpio_a_set(uint8_t led_gpio);

/** @brief Set GPIOA pin high to turn off LED.
 *  This function sets the specified GPIOA pin high using the BSRR register
 *  to turn off the connected LED light bulb.
 *  @param led_gpio The GPIOA pin number (0-7) connected to the LED.
 */
void gpio_a_reset(uint8_t led_gpio);

uint8_t gpio_read_pin(GPIO_TypeDef* GPIOx, uint8_t pin);

void gpio_SPI_init(void);//
void lora_ctrl_gpio_init(void);
void rst_low(void);
void rst_high(void);
void nss_low(void);
void nss_high(void);
uint8_t dio0_read(void);


void probe_pin_init(void);//test timing

// void reset_pin_1(void);

#ifdef __cplusplus
}
#endif

#endif // 
